[
  {
    "title": "new_old_ratio",
    "image_path": "new_old_ratio.png",
    "current_data": "null",
    "description": "📈 Summary: Most of your customers each month are new, not returning.\n\n🔍 Key Observations:\n- New customers consistently number above 2900 every month.\n- Recurring customers are very few, usually below 50.\n- There are small ups and downs, but new customers stay strong all year.\n\n✅ Tip for Action: Try to keep your new customers coming back more often by giving small rewards or special offers."
  },
  {
    "title": "order_by_hour",
    "image_path": "order_by_hour.png",
    "current_data": "{\"order_count\": 2175}",
    "description": "📈 Summary: Orders peak early in the morning and again in the early evening.\n\n🔍 Key Observations:\n- The busiest hour is 6 AM with the most orders.\n- There’s a dip in orders around midday and afternoon.\n- Orders pick up again after 5 PM and stay high until around 9 PM.\n\n✅ Tip for Action: Be ready with more food and staff for busy times at early morning and evening to serve customers faster."
  },
  {
    "title": "item_order_perhour",
    "image_path": "multi_day_hourly.png",
    "current_data": "{\"order_count\": 325}",
    "description": "📈 Summary: Orders stay busy all week with some ups and downs at different times each day.\n\n🔍 Key Observations:\n- Most days have higher orders in the morning and evening.\n- Sunday and Saturday show some of the highest order numbers, especially in the evening.\n- Weekdays dip a bit in early afternoon but pick back up later.\n\n✅ Tip for Action: Focus on staff and food prep for busy weekend evenings and keep good service on weekday mornings to catch steady orders."
  },
  {
    "title": "monthly_summary",
    "image_path": "monthly_income.png",
    "current_data": "{\"total_earnings\": 338858.5}",
    "description": "📈 Summary: Your income goes up and down each month, with some months much better than others.\n\n🔍 Key Observations:\n- May is the best month with the highest income.\n- October and December have the lowest income, showing a dip in sales.\n- Other months have steady but smaller changes.\n\n✅ Tip for Action: Look into what made May so good and try to copy that for slower months like October and December."
  },
  {
    "title": "item_sales_breakdown",
    "image_path": "item_sales_breakdown.png",
    "current_data": "[{\"item_name\": \"4-Piece Chicken Meal\", \"monthly_quantity\": 15918}, {\"item_name\": \"Chicken & Waffles\", \"monthly_quantity\": 8552}, {\"item_name\": \"Spicy Chicken Tenders\", \"monthly_quantity\": 4759}, {\"item_name\": \"Potato Wedges\", \"monthly_quantity\": 16702}]",
    "description": "📈 Summary: The 4-Piece Chicken Meal sells the most, while Potato Wedges lead among the sides.\n\n🔍 Key Observations:\n- Fried Chicken sales peak around May and then slowly dip.\n- Potato Wedges have a big spike in May but drop sharply after.\n- Chicken & Waffles and Spicy Chicken Tenders sell less and are fairly steady.\n\n✅ Tip for Action: Focus on promoting the popular 4-Piece Chicken Meal and Potato Wedges, especially before May’s peak season."
  }
]
