[
  {
    "title": "Total Sales",
    "current_data": "\"RM 338858.5\"",
    "description": "📈 Summary: Your business earned $338,858.50, which shows good income.\n\n🔍 Observations:\n- The total money you made is a healthy amount.\n- This number alone doesn’t say if this is more or less than before.\n- It’s important to compare this with past months to see growth or decline.\n\n✅ Recommendation: Try to track your earnings each month so you can spot if business is improving or needs attention."
  },
  {
    "title": "Ranking",
    "current_data": "{\"Side\": 26, \"Fried Chicken\": 1}",
    "description": "📈 Summary: Your fried chicken business is doing very well and is ranked #1 in its category.\n\n🔍 Observations:\n- The fried chicken part of your business holds the top spot in its category.\n- The side dishes are ranked 26th, showing they are less popular compared to fried chicken.\n- This means most customers likely come for your fried chicken items.\n\n✅ Recommendation: Focus on promoting your fried chicken since it’s your strongest point, and consider improving or marketing your side dishes more to boost their sales."
  },
  {
    "title": "Transport",
    "current_data": "[{\"_id\": \"0c2d7\", \"avg_order_to_arrival_mins\": 12.482846458186549, \"avg_arrival_to_pickup_mins\": 6.02441602081188, \"avg_pickup_to_delivery_mins\": 19.993496287464094, \"avg_total_delivery_mins\": 38.500758766462525}]",
    "description": "📈 Summary: Delivery times average around 38.5 minutes from order to customer, which is reasonable but could be improved.\n\n🔍 Observations:\n- It takes about 12.5 minutes on average for the driver to arrive after the order is placed.\n- Then around 6 minutes for food pickup after arrival.\n- The delivery from pickup to customer takes about 20 minutes.\n- Together, these add up to just over 38 minutes total delivery time.\n\n✅ Recommendation: Look for ways to speed up driver arrival or food pickup to reduce total delivery time and make customers happier."
  },
  {
    "title": "Market Price",
    "current_data": "{\"merchant_name\": \"Fried Chicken Express\", \"merchant_price\": [3.0, 9.17], \"cuisine_avg_price\": [2.840909090909091, 8.39], \"price_difference_percentage\": 7.45}",
    "description": "📈 Summary: Your prices are slightly higher than the average for your cuisine.\n\n🔍 Observations:\n- Your price range is between $3.00 and $9.17.\n- The average price for this cuisine is a bit lower, around $2.84 to $8.39.\n- Your prices are about 7.45% higher than the average.\n- This might mean customers see your food as more premium or you could be charging a bit more than other places.\n\n✅ Recommendation: Keep an eye on customer feedback to see if the higher prices are okay for them, or consider small discounts or combos to attract more buyers."
  }
]
