[
  {
    "title": "Total Sales",
    "current_data": "{\"total_earnings\": \n\"RM338858.5\"}",
    "description": "1. 📈 Summary: The business is doing well, especially with Fried Chicken.\n\n2. 🔍 Observations:\n   - The average delivery time from order to final delivery is about 38.5 minutes.\n   - Fried Chicken ranks as the top-performing item, while Sides rank lower at 26th.\n   - Total earnings amounted to $338,858.50, which is a healthy figure.\n\n3. ✅ Recommendation: Focus on promoting side dishes to balance sales across more menu items."
  },
  {
    "title": "Ranking",
    "current_data": "[{\"fried_chicken\": \"#1\", \"side\": \"#26\"}]",
    "description": "1. 📈 Summary: The business shows a strong performance in Fried Chicken, while delivery times are within a reasonable range.\n\n2. 🔍 Observations:\n   - The average total delivery time is about 38.5 minutes, with various stages like order-to-arrival and pickup-to-delivery all contributing to this.\n   - Fried Chicken is performing exceptionally well, ranked number 1 in its cuisine category.\n   - The 'Side' items are less popular, being ranked 26th in their category.\n\n3. ✅ Recommendation: Focus on promoting Fried Chicken dishes and consider ways to improve or diversify the 'Side' menu offerings to increase their popularity."
  },
  {
    "title": "Transport",
    "current_data": "[{\"_id\": null, \"avg_order_to_arrival_mins\": 12.482846458186549, \"avg_arrival_to_pickup_mins\": 6.02441602081188, \"avg_pickup_to_delivery_mins\": 19.993496287464094, \"avg_total_delivery_mins\": 38.500758766462525}]",
    "description": "1. 📈 Summary: The delivery process is generally smooth, taking just under 39 minutes on average.\n2. 🔍 Observations:\n   - It takes about 12.5 minutes from order to arrival at the restaurant.\n   - The wait time for picking up the order is roughly 6 minutes.\n   - Deliveries take about 20 minutes from pickup to reaching the customer.\n   - The total average delivery time is 38.5 minutes.\n3. ✅ Recommendation: Consider ways to reduce pickup wait time to make deliveries even faster."
  },
  {
    "title": "Market Price",
    "current_data": "{\"merchant_name\": \"Fried Chicken Express\", \"merchant_price\": 3.0, \"cuisine_avg_price\": NaN, \"price_difference\": NaN, \"percentage_difference\": \"nan%\"}",
    "description": "1. 📈 Summary: The business is doing well, especially with its top-selling fried chicken.\n\n2. 🔍 Observations:\n   - Delivery takes about 38.5 minutes in total, with each step (order to arrival, arrival to pickup, pickup to delivery) well under control.\n   - Fried chicken is the top-ranked item, while side dishes are far behind at 26th place.\n   - You've earned a solid $338,858.50.\n   - Pricing details for Fried Chicken Express show a price of $3, but average comparison data is missing.\n\n3. ✅ Recommendation: Keep up the great work with your fried chicken, and consider promoting your side dishes more to boost their popularity."
  }
]
